I am suffering the same issue. Terraform v0.14.10, AWS provider 3.36.0.
This is what the plan outputs:

    # aws_backup_vault.ps-backup-vault will be created
    + resource "aws_backup_vault" "ps-backup-vault" {
        + arn             = (known after apply)
        + id              = (known after apply)
        + kms_key_arn     = (known after apply)
        + name            = "prod-backup-vault"
        + recovery_points = (known after apply)
     }
